<details>
<summary>Execution result of "run-all plan" in "stacks/prod"</summary>

```terraform
time=2024-11-19T20:13:47Z level=info msg=The stack at /github/workspace/stacks/prod will be processed in the following order for command plan:
Group 1
- Module /github/workspace/stacks/prod/hetzner

Group 2
- Module /github/workspace/stacks/prod/kubernetes


time=2024-11-19T20:13:47Z level=info msg=Downloading Terraform configurations from file:///github/workspace/modules/hetzner into /github/workspace/stacks/prod/hetzner/.terragrunt-cache/7n5v_ZVOv4gLIvn-SLBHuU7F7OI/B-HSI5LUu0nLTnyopQYP4SLEkoU prefix=[/github/workspace/stacks/prod/hetzner] 
Initializing the backend...

Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/mrsimonemms/terraform-module-k3s.git for k3s...
- k3s in .terraform/modules/k3s
Initializing provider plugins...
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of loafoe/ssh from the dependency lock file
- Installing hetznercloud/hcloud v1.48.0...
- Installed hetznercloud/hcloud v1.48.0 (signed by a HashiCorp partner, key ID 5219EACB3A77198B)
- Installing hashicorp/local v2.5.1...
- Installed hashicorp/local v2.5.1 (signed by HashiCorp)
- Installing loafoe/ssh v2.7.0...
- Installed loafoe/ssh v2.7.0 (self-signed, key ID C0E4EB79E9E6A23D)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!
hcloud_network.network: Refreshing state... [id=10359702]
hcloud_ssh_key.server: Refreshing state... [id=24629412]
hcloud_placement_group.workers["pool1"]: Refreshing state... [id=421156]
hcloud_network_subnet.subnet: Refreshing state... [id=10359702-10.0.0.0/16]
hcloud_firewall.firewall: Refreshing state... [id=1740667]
hcloud_server.workers[1]: Refreshing state... [id=55742955]
hcloud_server.workers[0]: Refreshing state... [id=55742953]
hcloud_server.manager[0]: Refreshing state... [id=55742954]
ssh_resource.manager_ready[0]: Refreshing state... [id=2259762647014294198]
ssh_resource.workers_ready[0]: Refreshing state... [id=8802200626328928235]
ssh_resource.workers_ready[1]: Refreshing state... [id=3929059511596064850]
module.k3s.ssh_resource.initial_manager: Refreshing state... [id=1257207361098552077]
module.k3s.ssh_sensitive_resource.join_token: Refreshing state... [id=1118133096612813927]
module.k3s.ssh_sensitive_resource.kubeconfig: Refreshing state... [id=4284976079349531178]
local_sensitive_file.kubeconfig: Refreshing state... [id=5c26d8c02492f0b93e0a65ff2a9e6383abbe8195]
module.k3s.ssh_resource.install_workers["prod-k3s-pool1-1"]: Refreshing state... [id=8991009740447318170]
module.k3s.ssh_resource.install_workers["prod-k3s-pool1-0"]: Refreshing state... [id=6622661333265324505]
module.k3s.ssh_resource.drain_workers["prod-k3s-pool1-1"]: Refreshing state... [id=5286355072201017129]
module.k3s.ssh_resource.drain_workers["prod-k3s-pool1-0"]: Refreshing state... [id=1344319781362143294]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.kubeconfig will be created
  + resource "local_sensitive_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "/github/workspace/.kubeconfig"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
time=2024-11-19T20:13:56Z level=info msg=Downloading Terraform configurations from file:///github/workspace/modules/kubernetes into /github/workspace/stacks/prod/kubernetes/.terragrunt-cache/-HGVTuUtXSFDQCN7IIesL6CulRY/z4vfL_CY3720zQ-fo9fFtb8YbxA prefix=[/github/workspace/stacks/prod/kubernetes] 
Initializing the backend...

Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/kubernetes v2.31.0...
- Installed hashicorp/kubernetes v2.31.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.14.1...
- Installed hashicorp/helm v2.14.1 (signed by HashiCorp)
Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
kubernetes_namespace_v1.metallb: Refreshing state... [id=metallb-system]
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
kubernetes_secret_v1.hcloud: Refreshing state... [id=kube-system/hcloud]
kubernetes_namespace_v1.external_secrets: Refreshing state... [id=external-secrets]
kubernetes_secret_v1.infisical: Refreshing state... [id=external-secrets/infisical]
kubernetes_secret_v1.github_secret: Refreshing state... [id=argocd/github-oidc]
helm_release.hcloud_ccm: Refreshing state... [id=hccm]
helm_release.hcloud_csi: Refreshing state... [id=hcsi]
helm_release.argocd: Refreshing state... [id=argocd]
data.kubernetes_nodes.cluster: Reading...
data.kubernetes_nodes.cluster: Read complete after 1s [id=91dce43de04991b764d6ada3d83260322f67eee04f580a04a1f1e324cc0fca30]
kubernetes_config_map_v1.metallb: Refreshing state... [id=metallb-system/nodes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
        id                         = "argocd"
      ~ metadata                   = [
          - {
              - app_version    = "v2.13.0"
              - chart          = "argo-cd"
              - first_deployed = 1731778607
              - last_deployed  = 1731778607
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file `server.ingress.enabled` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login using Dex or OIDC.
                    
                    Redis can be accessed via port 6379   and Sentinel can be accessed via port 26379    on the following DNS name from within your cluster:
                    argocd-redis-ha.argocd.svc.cluster.local
                    
                    To connect to your Redis server:
                    1. To retrieve the redis password:
                       echo $(kubectl get secret argocd-redis-ha -o "jsonpath={.data['auth']}" | base64 --decode)
                    
                    2. Connect to the Redis master pod that you can use as a client. By default the argocd-redis-ha-server-0 pod is configured as the master:
                    
                       kubectl exec -it argocd-redis-ha-server-0 -n argocd -c redis -- sh
                    
                    3. Connect using the Redis CLI (inside container):
                    
                       redis-cli -a <REDIS-PASS-FROM-SECRET>
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - configs    = {
                          - cm     = {
                              - "admin.enabled"       = false
                              - "dex.config"          = <<-EOT
                                    "connectors":
                                    - "config":
                                        "clientID": "$github-oidc:clientId"
                                        "clientSecret": "$github-oidc:clientSecret"
                                        "orgs":
                                        - "name": "mrsimonemmsorg"
                                          "teams":
                                          - "home-admin"
                                      "id": "github"
                                      "name": "GitHub"
                                      "type": "github"
                                EOT
                              - "statusbadge.enabled" = true
                              - url                   = "https://argocd.simonemms.com"
                            }
                          - params = {
                              - "server.insecure" = true
                            }
                          - rbac   = {
                              - create       = true
                              - "policy.csv" = <<-EOT
                                    p, role:org-admin, applications, *, *, allow
                                    p, role:org-admin, applicationsets, *, *, allow
                                    p, role:org-admin, clusters, *, *, allow
                                    p, role:org-admin, projects, *, *, allow
                                    p, role:org-admin, repositories, *, *, allow
                                    p, role:org-admin, accounts, *, *, allow
                                    p, role:org-admin, certificates, *, *, allow
                                    p, role:org-admin, gpgkeys, *, *, allow
                                    p, role:org-admin, logs, *, *, allow
                                    p, role:org-admin, exec, *, *, allow
                                    p, role:org-admin, extensions, *, *, allow
                                    g, mrsimonemmsorg:home-admin, role:org-admin
                                EOT
                            }
                        }
                      - global     = {
                          - domain = "argocd.simonemms.com"
                        }
                      - redis-ha   = {
                          - enabled = true
                        }
                      - repoServer = {
                          - autoscaling = {
                              - enabled     = true
                              - minReplicas = 2
                            }
                        }
                      - server     = {
                          - autoscaling = {
                              - enabled     = true
                              - minReplicas = 2
                            }
                          - ingress     = {
                              - annotations      = {
                                  - "cert-manager.io/cluster-issuer"                 = "letsencrypt"
                                  - "gethomepage.dev/description"                    = "Get stuff done with Kubernetes!"
                                  - "gethomepage.dev/enabled"                        = "true"
                                  - "gethomepage.dev/group"                          = "Cluster Management"
                                  - "gethomepage.dev/icon"                           = "argocd"
                                  - "gethomepage.dev/name"                           = "ArgoCD"
                                  - "kubernetes.io/tls-acme"                         = "true"
                                  - "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
                                  - "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                                }
                              - enabled          = true
                              - extraTLS         = [
                                  - {
                                      - hosts      = [
                                          - "argocd.simonemms.com",
                                        ]
                                      - secretName = "argocd-tls"
                                    },
                                ]
                              - ingressClassName = "nginx"
                              - tls              = true
                            }
                        }
                    }
                )
              - version        = "7.7.3"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          ~ <<-EOT
                global:
                  domain: argocd.simonemms.com
                redis-ha:
                  enabled: true
                repoServer:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    annotations:
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      nginx.ingress.kubernetes.io/backend-protocol: HTTP
                      kubernetes.io/tls-acme: "true"
                      cert-manager.io/cluster-issuer: letsencrypt
                
                      gethomepage.dev/description: Get stuff done with Kubernetes!
                      gethomepage.dev/enabled: "true"
                      gethomepage.dev/group: Cluster Management
                      gethomepage.dev/icon: argocd
                      gethomepage.dev/name: ArgoCD
                    tls: true
                    extraTLS:
                      - hosts:
                          - argocd.simonemms.com
                        secretName: argocd-tls
                configs:
                  cm:
                    admin.enabled: false
                    dex.config: |-
                      "connectors":
                      - "config":
                          "clientID": "$github-oidc:clientId"
                          "clientSecret": "$github-oidc:clientSecret"
                          "orgs":
                          - "name": "mrsimonemmsorg"
                            "teams":
                            - "home-admin"
                        "id": "github"
                        "name": "GitHub"
                        "type": "github"
                      
              +     kustomize.buildOptions: --enable-helm
                    statusbadge.enabled: true
                    url: https://argocd.simonemms.com
                  params:
                    server.insecure: true
                  rbac:
                    create: true
                    policy.csv: |
                      p, role:org-admin, applications, *, *, allow
                      p, role:org-admin, applicationsets, *, *, allow
                      p, role:org-admin, clusters, *, *, allow
                      p, role:org-admin, projects, *, *, allow
                      p, role:org-admin, repositories, *, *, allow
                      p, role:org-admin, accounts, *, *, allow
                      p, role:org-admin, certificates, *, *, allow
                      p, role:org-admin, gpgkeys, *, *, allow
                      p, role:org-admin, logs, *, *, allow
                      p, role:org-admin, exec, *, *, allow
                      p, role:org-admin, extensions, *, *, allow
                      g, mrsimonemmsorg:home-admin, role:org-admin
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>
    
